Tekla.Structures.CatalogInternal.ShapeMetadata
ShapeMetadata represents metadata value that is input by the user.

Tekla.Structures.CatalogInternal.ShapeMetadata.#ctor(System.Object,Tekla.Structures.CatalogInternal.ShapeMetadataTypeEnum,System.String,System.String)
Initializes a new instance of the Tekla.Structures.CatalogInternal.ShapeMetadata class.
val: Metadata value
type: Metadata typeTekla.Structures.CatalogInternal.ShapeMetadataTypeEnum
label:  Metadata label
description: Metadata description

Tekla.Structures.CatalogInternal.ShapeMetadata.Value
Limited to 128 characters

Tekla.Structures.CatalogInternal.ShapeMetadata.Type
Data type or unit for this metadata entry

Tekla.Structures.CatalogInternal.ShapeMetadata.Label
Limited to 128 characters

Tekla.Structures.CatalogInternal.ShapeMetadata.Description
Limited to 128 characters

Tekla.Structures.CatalogInternal.ShapeMetadata.ConvertStringListToShapeMetadata(System.Collections.Generic.List{System.String})
Converts string list of 4 values to shape metadata.
metadataAsStringList: String list with one element for each of 4 fields in ShapeMetadata
Returns: ShapeMetadata formed by using strings from input string list

Tekla.Structures.CatalogInternal.ShapeMetadata.ConvertStringMatadataToShapeMetadata(System.Collections.Generic.List{System.Tuple{System.String,System.Collections.Generic.List{System.String}}})
Convert list of metadata values, represented as a list of key-values (string list)
to list of key-values (metadata list)
metadatasStringList: Metadata as list of string
Returns: List of key-metadata tuples.

Tekla.Structures.CatalogInternal.ShapeMetadata.Equals(System.Object)
Returns true if the objects are equal.
obj: The object that equality is wished to be checked with.
Returns: True if the objects are equal.

Tekla.Structures.CatalogInternal.ShapeMetadata.GetHashCode
Get the hashcode based on the value.
Returns: The hashed number.

Tekla.Structures.CatalogInternal.ShapeMetadata.ConvertToStringList
Convert ShapeMetadata to string list.
Returns: Shape metadata field transformed to a list of strings